import random
garnir_obed = ["Тефтели с рисом", "Котлеты", "Индейка"]
obed_plus = ["Плов из индейки", "Плов из говядины"]

garnir_ujin = ["Цыплята отварные", "Минтай", "Фрикадельки", "Печень", "Горбуша"]

osnova = ["Гречка", "Картофель отварной", "Макароны", "Картофельное пюре", "Рис"]

dni_nedeli = ["Понедельник", "Вторник", "Среда", "Чутверг", "Пятница", "Суббота", "Воскресенье"]

obed = []
#i = 1
for i in garnir_obed:
    garn = []
    for x in osnova:
        garn.append([i, x])
    obed.append(garn)


print(obed)

# full_obed = obed+obed_plus
# print(full_obed)
# print(len(full_obed))
'''
[
    ['Тефтели с рисом', 'Гречка'], ['Тефтели с рисом', 'Картофель отварной'], ['Тефтели с рисом', 'Макароны'],['Тефтели с рисом', 'Картофельное пюре'], ['Тефтели с рисом', 'Рис'],
    ['Котлеты', 'Гречка'], ['Котлеты', 'Картофель отварной'], ['Котлеты', 'Макароны'], ['Котлеты', 'Картофельное пюре'], ['Котлеты', 'Рис'],
    ['Индейка', 'Гречка'], ['Индейка', 'Картофель отварной'], ['Индейка', 'Макароны'], ['Индейка', 'Картофельное пюре'], ['Индейка', 'Рис']
]

сначала 0,1,2
затем в массив индеек докидываем плов и продолжаем 0,1,2
если в массиве основ не существует нужного индекса то проверяем не пустой ли массив основ, если нет то вычитаем из из индекса -1 
[
    , , ,, ,
    , , , , ,
    ['Индейка', 'Гречка'], ['Индейка', 'Картофель отварной'], , , ,  
]

[
    ['Тефтели с рисом', 'Гречка'],  ['Котлеты', 'Картофель отварной'], ['Индейка', 'Макароны'],
    ['Тефтели с рисом', 'Картофель отварной'], ['Котлеты', 'Макароны'], ['Индейка', 'Картофельное пюре'],
    ['Тефтели с рисом', 'Макароны'], ['Котлеты', 'Картофельное пюре'], ['Индейка', 'Рис'],
    ['Тефтели с рисом', 'Картофельное пюре'], ['Котлеты', 'Рис'], ["Плов из индейки"],
    ['Тефтели с рисом', 'Рис'], ['Котлеты', 'Гречка'], ["Плов из говядины"]
]


obed = [
    [['Тефтели с рисом', 'Гречка'], ['Тефтели с рисом', 'Картофель отварной'], ['Тефтели с рисом', 'Макароны'], ['Тефтели с рисом', 'Картофельное пюре'], ['Тефтели с рисом', 'Рис']],[['Котлеты', 'Гречка'], ['Котлеты', 'Картофель отварной'], ['Котлеты', 'Макароны'], ['Котлеты', 'Картофельное пюре'], ['Котлеты', 'Рис']],
    [['Индейка', 'Гречка'], ['Индейка', 'Картофель отварной'], ['Индейка', 'Макароны'], ['Индейка', 'Картофельное пюре'], ['Индейка', 'Рис']]
]

mixed_obed = []
step = 0
while 
for x in obed:
    mixed_obed.append(x[step])
    
    step = step + 1

'''

